Repository: flutter-form-builder-ecosystem/flutter_form_builder
Catalog: packages/form_builder_validators/lib/l10n/intl_*.arb
Languages: bn, es, fr, hu, id, pl, pt, sk, zh_hans, zh_hant

# requiredErrorText
source: This field cannot be empty.
bn: এই ক্ষেত্রটি খালি রাখা যাবে না।
es: Este campo no puede estar vacío.
fr: Ce champ ne peut pas être vide.
hu: Ennek a mezőnek értéket kell adni.
id: Bidang ini tidak boleh kosong.
pl: To pole nie może być puste.
pt: Este campo não pode ficar vazio.
sk: Toto pole nesmie byť prázdne.
zh_hans: 此字段不能为空。
zh_hant: 此字段不能為空。

# minErrorText
source: Value must be greater than or equal to {min}.
bn: মান এর থেকে বেশি বা সমান হতে হবে {min}।
es: El valor debe ser mayor o igual que {min}.
fr: La valeur doit être supérieure ou égale à {min}.
hu: Az érték legyen legalább {min}.
id: Nilai harus lebih besar dari atau sama dengan {min}.
pl: Wartość musi być większa lub równa {min}.
pt: O valor deve ser maior ou igual a {min}.
sk: Hodnota musí byť väčšia alebo rovná ako {min}.
zh_hans: 此字段必须大于或等于{min}
zh_hant: 此字段必須大於或等於{min}

# minLengthErrorText
source: Value must have a length greater than or equal to {minLength}
bn: মান অবশ্যই এর চেয়ে বেশি বা সমান দৈর্ঘ্য থাকতে হবে {minLength}।
es: El valor debe tener una longitud mayor o igual a {minLength}
fr: La valeur doit avoir une longueur supérieure ou égale à {minLength}
hu: Az értéknel legalább {minLength} karakter hosszúnak kell lennie
id: Panjang karakter harus lebih besar dari atau sama dengan {minLength}
pl: Wartość musi mieć co najmniej {minLength} znaków.
pt: O valor deve ter um comprimento maior ou igual a {minLength}
sk: Hodnota musí mať dĺžku aspoň {minLength} znakov.
zh_hans: 此字段的长度必须大于或等于{minLength}
zh_hant: 此字段的長度必須大於或等於{minLength}

# maxErrorText
source: Value must be less than or equal to {max}
bn: মান এর থেকে কম বা সমান হতে হবে {max}।
es: El valor debe ser menor o igual que {max}.
fr: La valeur doit être inférieure ou égale à {max}
hu: Az érték legyen legfeljebb {max}
id: Nilai harus kurang dari atau sama dengan {max}
pl: Wartość musi być mniejsza lub równa {max}.
pt: O valor deve ser menor ou igual a {max}
sk: Hodnota musí byť menšia alebo rovná ako {max}.
zh_hans: 此字段必须小于或等于{max}
zh_hant: 此字段必須小於或等於{max}

# maxLengthErrorText
source: Value must have a length less than or equal to {maxLength}
bn: মান অবশ্যই এর থেকে কম বা সমান দৈর্ঘ্য থাকতে হবে {maxLength}।
es: El valor debe tener una longitud menor o igual a {maxLength}
fr: La valeur doit avoir une longueur inférieure ou égale à {maxLength}
id: Panjang karakter harus kurang dari atau sama dengan {maxLength}
pl: Wartość nie może mieć więcej niż {maxLength} znaków.
pt: O valor deve ter um comprimento menor ou igual a {maxLength}
sk: Hodnota musí mať dĺžku najviac {maxLength} znakov.
zh_hans: 此字段的长度必须小于或等于{maxLength}
zh_hant: 此字段的長度必須小於或等於{maxLength}

# emailErrorText
source: This field requires a valid email address.
bn: এই ক্ষেত্রে একটি বৈধ ইমেল ঠিকানা প্রয়োজন।
es: Este campo requiere una dirección de correo electrónico válida.
fr: Ce champ nécessite une adresse e-mail valide.
hu: A megadott érték nem egy érvényes email cím.
id: Alamat email tidak valid.
pl: To pole wymaga prawidłowego adresu e-mail.
pt: Este campo requer um endereço de e-mail válido.
sk: Toto pole vyžaduje platnú emailovú adresu.
zh_hans: 此字段需要有效的电子邮件地址。
zh_hant: 此字段需要有效的電子郵件地址。

# integerErrorText
source: This field requires a valid integer.
bn: এই ক্ষেত্রের একটি বৈধ পূর্ণসংখ্যা প্রয়োজন।
id: Nilai harus berupa bilangan bulat.
pl: Wartość musi być liczbą całkowitą.
sk: Hodnota musí byť celé číslo.
zh_hans: 此字段需要有效的整数。
zh_hant: 此字段需要有效的整數。

# equalErrorText
source: This field value must be equal to {value}.
bn: এই ক্ষেত্রের মান সমান হতে হবে {value}।
id: Nilai bidang ini harus sama dengan {value}.
pl: Wartość tego pola musi wynosić {value}.
sk: Hodnota tohto poľa musí byť {value}.
zh_hans: 此字段必须与{value}相符
zh_hant: 此字段必須與{value}相符

# notEqualErrorText
source: This field value must not be equal to {value}.
bn: এই ক্ষেত্রের মান সমান হওয়া উচিত নয় {value}।
id: Nilai bidang ini tidak boleh sama dengan {value}.
pl: Wartość tego pola nie może być {value}.
sk: Hodnota tohto poľa nesmie byť {value}.
zh_hans: 此字段不得等于{value}
zh_hant: 此字段不得等於{value}

# urlErrorText
source: This field requires a valid URL address.
bn: এই ক্ষেত্রের একটি বৈধ ওয়েব ঠিকানা প্রয়োজন।
es: Este campo requiere una dirección URL válida.
fr: Ce champ nécessite une adresse URL valide.
hu: A megadott érték nem egy érvényes URL cím.
id: URL tidak valid
pl: To pole wymaga prawidłowego adresu URL.
pt: Este campo requer um endereço de URL válido.
sk: Toto pole vyžaduje platnú URL adresu.
zh_hans: 此字段需要有效的URL地址。
zh_hant: 此字段需要有效的URL地址。

# matchErrorText
source: Value does not match pattern.
bn: মান প্যাটার্নের সাথে মেলে না।
es: El valor no coincide con el patrón requerido.
fr: La valeur ne correspond pas au modèle.
hu: A megadott érték nem egyezik a szükséges formátummal.
id: Nilai tidak cocok dengan pola.
pl: Wartość nie pasuje do oczekiwanego kształtu.
pt: O valor não corresponde ao padrão.
sk: Hodnota nevyhovuje očakávanému tvaru.
zh_hans: 此字段与格式不匹配。
zh_hant: 此字段與格式不匹配。

# numericErrorText
source: Value must be numeric.
bn: মান অবশ্যই সাংখ্যিক হতে হবে।
es: El valor debe ser numérico.
fr: La valeur doit être numérique.
hu: Ebbe a mezőbe csak számot lehet írni.
id: Nilai harus berupa angka.
pl: Wartość musi być liczbą.
pt: O valor deve ser numérico.
sk: Hodnota musí byť číslo.
zh_hans: 此字段必须是数字。
zh_hant: 此字段必須是數字。

# creditCardErrorText
source: This field requires a valid credit card number.
bn: এই ক্ষেত্রে একটি বৈধ ক্রেডিট কার্ড নম্বর প্রয়োজন।
es: Este campo requiere un número de tarjeta de crédito válido.
fr: Ce champ nécessite un numéro de carte de crédit valide.
hu: A megadott érték nem egy érvényes bankkártya szám.
id: Nomor kartu kredit tidak valid.
pl: To pole wymaga podania ważnego numeru karty kredytowej.
pt: Este campo requer um número de cartão de crédito válido.
sk: Toto pole vyžaduje platné číslo platobnej karty.
zh_hans: 此字段需要有效的信用卡号码。
zh_hant: 此字段需要有效的信用卡號碼。

# ipErrorText
source: This field requires a valid IP.
bn: এই ক্ষেত্রে একটি বৈধ আইপি প্রয়োজন।
es: Este campo requiere una IP válida.
fr: Ce champ nécessite une adresse IP valide.
hu: A megadott érték nem egy érvényes IP cím.
id: Alamat IP tidak valid.
pl: To pole wymaga prawidłowego adresu IP.
pt: Este campo requer um IP válido.
sk: Toto pole vyžaduje platnú IP adresu.
zh_hans: 此字段需要有效的IP。
zh_hant: 此字段需要有效的IP。

# dateStringErrorText
source: This field requires a valid date string.
bn: এই ক্ষেত্রে একটি বৈধ তারিখ স্ট্রিং প্রয়োজন।
es: Este campo requiere una cadena de fecha válida.
fr: Ce champ nécessite une chaîne de date valide.
hu: Ennek a mezőnek dátumnak kell lennie.
id: Tanggal tidak valid
pl: To pole wymaga prawidłowej daty.
pt: Este campo requer uma string de data válida.
sk: Toto pole vyžaduje platný dátum.
zh_hans: 此字段需要有效的日期字符串。
zh_hant: 此字段需要有效的日期字符串。
